## Pandas
*Pandas is an Open source ,BSD licenced library providing:
 1. High Performance
 2. Easy to use Data Structures
 3. Data Analysis tools for Python

#Data Frame and Data series
1. If Data is having more than one column then it is Dataframe with Row indexes and column names
2. Data with  less than one column (that means only rows) or only one column(and atlest 1 row ) called series

In [220]:
import pandas as pd
import numpy as np

In [221]:
#Creating Data Frame
#arguments needed: 1 array/numpy array),index(Row indexes),columns=(columnnames)
list1=list(range(1,21))
arr=np.array(list1)
df=pd.DataFrame(arr.reshape(5,4),index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4'])
print('numpy array')
print(arr)
print('Dataframe')
print(df)
#Creating DataFrame

numpy array
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]
Dataframe
    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [222]:
#dataframe conversion to csv and will stored the folder notebook present
df.to_csv('t1.csv')

In [223]:
#accessing columns
df.loc['R1','C1'] #got value in C1 column value in R1 row
df.loc[:,'C1'] #all rows of C1 column
#whenever there is one or less than one column result will be series else it will be dataframe

R1     1
R2     5
R3     9
R4    13
R5    17
Name: C1, dtype: int32

In [224]:
type(df.loc['R1'])

pandas.core.series.Series

In [225]:
type(df.loc[:,'C1'])

pandas.core.series.Series

In [226]:
df.iloc[:,] #returning all columns all rows

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [227]:
type(df.iloc[:,]) #more than one column returns dataframe

pandas.core.frame.DataFrame

In [228]:
#To select speific rows and columns
df.iloc[:3,:4] # return 3 rows 4 columns

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12

In [229]:
#convert dataframe to array
df.iloc[:,:].values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [230]:
type(df.iloc[:,:].values) # generating numpy array

numpy.ndarray

In [231]:
df.iloc[:,:].values.shape # @D array with 5 rows 4 columns

(5, 4)

In [232]:
#Null check condition
df.isnull().sum()

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [233]:
# if we want to check any duplicate value present in any column
#we will check valuecount if its equal to 1 no duplicates
df['C1'].value_counts() #no dupicate present

C1
1     1
5     1
9     1
13    1
17    1
Name: count, dtype: int64

In [234]:
#to get column's unique values #only works for column because rows are indexes
df['C1'].unique()

array([ 1,  5,  9, 13, 17])

In [235]:
#reading csv file
merc_data=pd.read_csv('merc.csv')
merc_data

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867
...,...,...,...,...,...,...,...,...,...,...
9995,Kia,Optima,2004,3.7,Diesel,Semi-Automatic,5794,2,4,8884
9996,Chevrolet,Impala,2002,1.4,Electric,Automatic,168000,2,1,6240
9997,BMW,3 Series,2010,3.0,Petrol,Automatic,86664,5,1,9866
9998,Ford,Explorer,2002,1.4,Hybrid,Automatic,225772,4,1,4084
9999,Volkswagen,Tiguan,2001,2.1,Diesel,Manual,157882,3,3,3342

In [236]:
#top 5 rows
merc_data.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [237]:
#last 5 rows
merc_data.tail()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
9995,Kia,Optima,2004,3.7,Diesel,Semi-Automatic,5794,2,4,8884
9996,Chevrolet,Impala,2002,1.4,Electric,Automatic,168000,2,1,6240
9997,BMW,3 Series,2010,3.0,Petrol,Automatic,86664,5,1,9866
9998,Ford,Explorer,2002,1.4,Hybrid,Automatic,225772,4,1,4084
9999,Volkswagen,Tiguan,2001,2.1,Diesel,Manual,157882,3,3,3342

In [238]:
#specific number of first and last rows
merc_data.head(10)

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867
5,Toyota,Camry,2007,2.7,Petrol,Automatic,157889,4,4,7242
6,Honda,Civic,2010,3.4,Electric,Automatic,139584,3,1,11208
7,Kia,Sportage,2001,4.7,Electric,Semi-Automatic,157495,2,2,7950
8,Kia,Sportage,2014,2.6,Hybrid,Manual,98700,3,4,9926
9,Toyota,RAV4,2005,3.1,Petrol,Manual,107724,2,5,6545

In [239]:
merc_data.tail(10)

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
9990,Audi,A3,2019,1.8,Electric,Manual,85496,4,3,11890
9991,Mercedes,E-Class,2017,1.1,Diesel,Automatic,179286,5,1,8214
9992,BMW,5 Series,2016,1.2,Hybrid,Automatic,13386,3,5,12332
9993,Honda,Accord,2019,4.7,Hybrid,Semi-Automatic,155874,4,3,12382
9994,Honda,Civic,2016,2.9,Petrol,Manual,255889,2,2,6682
9995,Kia,Optima,2004,3.7,Diesel,Semi-Automatic,5794,2,4,8884
9996,Chevrolet,Impala,2002,1.4,Electric,Automatic,168000,2,1,6240
9997,BMW,3 Series,2010,3.0,Petrol,Automatic,86664,5,1,9866
9998,Ford,Explorer,2002,1.4,Hybrid,Automatic,225772,4,1,4084
9999,Volkswagen,Tiguan,2001,2.1,Diesel,Manual,157882,3,3,3342

In [240]:
#standard info 
merc_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         10000 non-null  object
 1   Model         10000 non-null  object
 2   Year          10000 non-null  int64
 3   Engine_Size   10000 non-null  float64
 4   Fuel_Type     10000 non-null  object
 5   Transmission  10000 non-null  object
 6   Mileage       10000 non-null  int64
 7   Doors         10000 non-null  int64
 8   Owner_Count   10000 non-null  int64
 9   Price         10000 non-null  int64
dtypes: float64(1), int64(5), object(4)
memory usage: 781.4+ KB

In [241]:
#statstical info this consider only integer and floating point features
merc_data.describe()

,Year,Engine_Size,Mileage,Doors,Owner_Count,Price
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000
mean,2011.543700,3.000560,149239.111800,3.497100,2.991100,8852.96440
std,6.897699,1.149324,86322.348957,1.110097,1.422682,3112.59681
min,2000.000000,1.000000,25.000000,2.000000,1.000000,2000.00000
25%,2006.000000,2.000000,74649.250000,3.000000,2.000000,6646.00000
50%,2012.000000,3.000000,149587.000000,3.000000,3.000000,8858.50000
75%,2017.000000,4.000000,223577.500000,4.000000,4.000000,11086.50000
max,2023.000000,5.000000,299947.000000,5.000000,5.000000,18301.00000

In [242]:
#if csv file has ; as separator instead of '
pd.read_csv('t2.csv',sep=';')  #sep attribute is required

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

**if my data in file  is like**
testfile=
('col1,col2,col3,\n',
'x,y,z,1\n',
'a,b,c,2,\n')
  -To read this pd.read_csv(StringIO('testfile.csv'))

In [243]:
#way to read data from csv(another kind)
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('test.csv').getvalue())
print(df)

  col1 col2  col3   \n
0    x    y     1   \n
1    a    b     2   \n

In [244]:
import pandas as pd
import io
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),dtype=float)
print(df)

   col1  col2  col3
0  10.0  20.0  30.0
1  40.0  50.0  60.0

In [245]:
import pandas as pd
import io
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),dtype=str) #converting df values to string
print(df)

  col1 col2 col3
0   10   20   30
1   40   50   60

In [246]:
df.loc[0,'col1']  #returning str

'10'

In [247]:
import pandas as pd
import io
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),dtype=int) #converting df values to integer
df.loc[0,'col1'] #return integer

10

In [248]:
import pandas as pd
import io
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),dtype=float) #converting df values to float
df.loc[0,'col1'] #return float

10.0

In [249]:
# settig datatype column wise
import pandas as pd
import io
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),dtype={'col1':int,'col2':str,'col3':float}) #converting df values to float
print(df.loc[0,'col1'],'return integer') 
print(df.loc[0,'col2'],'return string')
print(df.loc[0,'col3'],'return float')

10 return integer
20 return string
30.0 return float

In [250]:
#to check type of all columns
df.dtypes

col1      int32
col2     object
col3    float64
dtype: object

In [251]:
#setting index
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('t3.csv').getvalue())
df.index.name='Index'
print(df)

       col1  col2  col3
Index
0        10    20    30
1        40    50    60

In [252]:
#now lets make col1 as index
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),index_col=['col1'])
df

      col2  col3
col1
10      20    30
40      50    60

In [253]:
#to prevent to take first value as index if dtype =none 
#set index_col=False,
#use_cols=will use only mention required columns
#escape char = use to skip specific character

In [254]:
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('t3.csv').getvalue(),index_col=False,usecols=['col2','col3'])
df

   col2  col3
0    20    30
1    50    60

In [255]:
#without escape character showing in df same as in csv
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('test.csv').getvalue())
print(df)

  col1 col2  col3   \n
0    x    y     1   \n
1    a    b     2   \n

In [256]:
#with escapechar \ is removed in df which was present in csvs (skips the escape char '\'
import pandas as pd
from io import StringIO
df=pd.read_csv(io.StringIO('test.csv').getvalue(),escapechar='\\')
print(df)

  col1 col2  col3   n
0    x    y     1   n
1    a    b     2   n

In [257]:
#Read json 
import pandas as pd
from io import StringIO
#Data_json='{"First_Name":"John","Last_Name":"Doe","Address":{"Country":"India","City":"Delhi"}},{"First_Name":"James","Last_Name":"smith","Address":{"Country":"US","City":"Newyork"}}'
Data=pd.read_json(io.StringIO('Json_Data.json').getvalue())
Data

  firstname lastname                                         Address
0       Joe      Doe           {'Country': 'India', 'City': 'Delhi'}
1     James    Smith  {'Country': 'UnitedStates', 'City': 'NewYork'}

In [259]:
df=pd.read_csv('t1.csv',index_col=[0])
print(df)

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [ ]:
df.to_csv('new_data.csv')

In [ ]:
d1=df.to_json() #dataframe to json conversion
d1

# converting Dataframe to different Json formats changing values of
**orient='columns','index','values','records','split'**
- orient parameters controls the format of Json string
- Default value of orient is columns i.e when we don't give any value

1. Not using orient parameter
2. Using orient parameter with value 'columns'
- Both will give same result

In [261]:

Data=pd.read_json(io.StringIO('Json_Data.json').getvalue())
Data

  firstname lastname                                         Address
0       Joe      Doe           {'Country': 'India', 'City': 'Delhi'}
1     James    Smith  {'Country': 'UnitedStates', 'City': 'NewYork'}

In [262]:
#example of 1.

res=Data.to_json()
res

'{"firstname":{"0":"Joe","1":"James"},"lastname":{"0":"Doe","1":"Smith"},"Address":{"0":{"Country":"India","City":"Delhi"},"1":{"Country":"UnitedStates","City":"NewYork"}}}'

In [263]:
res1=Data.to_json(orient='columns')
res1

'{"firstname":{"0":"Joe","1":"James"},"lastname":{"0":"Doe","1":"Smith"},"Address":{"0":{"Country":"India","City":"Delhi"},"1":{"Country":"UnitedStates","City":"NewYork"}}}'

* res & res1 both giving same results,that means default value of orient is columns
* This is giving column oriented Json

In [264]:
#orient ='records' this will give list of dictiories,each one will represent one row
res=Data.to_json(orient='records')
res

'[{"firstname":"Joe","lastname":"Doe","Address":{"Country":"India","City":"Delhi"}},{"firstname":"James","lastname":"Smith","Address":{"Country":"UnitedStates","City":"NewYork"}}]'

In [265]:
res=Data.to_json(orient='index') #row oriented format
res

'{"0":{"firstname":"Joe","lastname":"Doe","Address":{"Country":"India","City":"Delhi"}},"1":{"firstname":"James","lastname":"Smith","Address":{"Country":"UnitedStates","City":"NewYork"}}}'

In [266]:
res=Data.to_json(orient='split') #represents dictionaries containing indexes columns &data
res

'{"columns":["firstname","lastname","Address"],"index":[0,1],"data":[["Joe","Doe",{"Country":"India","City":"Delhi"}],["James","Smith",{"Country":"UnitedStates","City":"NewYork"}]]}'

In [267]:
res=Data.to_json(orient='values') #represents 2D array of values
res

'[["Joe","Doe",{"Country":"India","City":"Delhi"}],["James","Smith",{"Country":"UnitedStates","City":"NewYork"}]]'

# Reading HTML Content

Reading html is also called **WEBScraping** (Need to learn more about this)
:It basically means reading tables from HTML Page
*its related to tables only'

In [296]:
import pandas as pd
import io
url="https://uk-air.defra.gov.uk/data/DAQI-regional-data?regionIds%5B%5D=999&aggRegionId%5B%5D=999&datePreset=6&startDay=01&startMonth=01&startYear=2022&endDay=01&endMonth=01&endYear=2023&queryId=&action=step2&go=Next+"
dfs = pd.read_html(url,header=0) #fetch all table in the site
print(type(dfs),len(dfs))
dfs[0]

<class 'list'> 1

,Date,Central Scotland,East Midlands,Eastern,Greater London,Highland,North East,North East Scotland,North Wales,North West & Merseyside,...,Greater Manchester Urban Area,Leicester Urban Area,Liverpool Urban Area,Nottingham Urban Area,Portsmouth Urban Area,Sheffield Urban Area,Swansea Urban Area,Tyneside,West Midlands Urban Area,West Yorkshire Urban Area
0,01/01/2024,3,3,3,3,2,2,2,3,3,...,3,2,3,2,3,2,2,2,3,3
1,02/01/2024,2,3,3,3,3,3,3,3,3,...,3,3,3,2,3,2,3,2,3,2
2,03/01/2024,2,3,3,3,2,2,2,3,3,...,2,3,2,2,3,2,3,2,3,2
3,04/01/2024,2,2,3,2,2,2,2,3,2,...,2,2,2,2,3,2,2,2,2,2
4,05/01/2024,2,2,3,3,3,3,2,2,2,...,2,2,2,2,2,2,2,2,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
361,27/12/2024,2,2,2,2,3,2,2,3,4,...,2,1,2,1,2,2,1,2,1,2
362,28/12/2024,2,2,1,1,3,2,2,2,2,...,2,1,1,1,2,2,2,2,1,1
363,29/12/2024,3,3,2,2,3,3,3,3,3,...,2,2,2,2,2,2,3,3,2,3
364,30/12/2024,3,3,3,3,3,3,3,3,3,...,3,3,3,2,2,3,3,3,3,3
365,31/12/2024,3,3,3,3,3,3,3,3,3,...,3,3,3,3,3,3,3,3,3,3

#Read Excel
pd.read_excel('excel_file_name,sheet_name='can specify sheet name or number otherwise by defult this will pick 0)

# Pickling:  (Need to Read more about this) 
 
- All Pandas objects are equipped with to_pickel method to save the datastructure to disk using pickle format
- method is pd.to_pickle('excel file name'))